import json
from function import formation_dictionary_of_recipes, get_shop_list_by_dishes, union_files

if __name__ == '__main__':
    print("Задание 1")
    print("___________________________________________________________________________________________________________")
    #  формирование вывода словаря книги с рецептами в json-формате
    print(json.dumps(formation_dictionary_of_recipes(), ensure_ascii=False, indent=4))

    print()
    print("Задание 2")
    print("___________________________________________________________________________________________________________")
    #  формирование вывода словаря ингридиентов и информации о них по запрошенным блюдам в json-формате
    print(get_shop_list_by_dishes(['Фахитос', 'Омлет'], 4))

    print()
    print("Задание 3")
    print("___________________________________________________________________________________________________________")
    print(union_files())
